cleanli2/stm32/src/common.c
#include "stm32f10x.h"
#include "board.h"
#include "common.h"
#include "cmd.h"
#include "lprintf.h"
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include "sd/stm32_eval_spi_sd.h"
#include "os_task.h"
#include "ring_buf.h"
#include "display.h"

/** @addtogroup STM32F10x_StdPeriph_Examples
  * @{
  */

/** @addtogroup GPIO_IOToggle
  * @{
  */
extern unsigned long debug_enable;

u32 intrpt_time[NUM_INTRPT]={0};
u32 debug_mode = 0;
DECLARE_OS_LOCK(oslk_evt, EVT_LOCK_NO);
DECLARE_RB_DATA(evt, rb_evt, 3)
#define COUNTS_PER_US 6

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
GPIO_InitTypeDef GPIO_InitStructure;
USART_InitTypeDef USART_InitStructure;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

u32 last_systick;
u32 interv_systick;
static int sound_enable=1;
static uint32_t g_10ms_count = 0;
uint32_t g_ms_count = 0;
void os_task1(void*);
void os_task2(void*);
void os_task3(void*);
void compute_cpu_occp();



/*led8s display*/
extern date_info_t g_cur_date;
#define LED8S_LASTDELAY (LED8S_INTV_PER_SECOND*2) //delay when move to end
#define LED8S_INTV 1 //interval between each move
#define LED8S_INTV_PER_SECOND 5 //interval between each move
static uint date_move_direction_led8s=1;//1-to right 0-to left
static int date_pos_led8s=0;
static uint date_ct_led8s=0;
static uint date_ct_led8s_lastdelay=LED8S_LASTDELAY;
void led8s_task(void*p)
{
    char*date;
    (void)p;
    while(1){
        os_ms_delay(100);
        date = get_rtc_time(&g_cur_date);
        if(date_ct_led8s++>LED8S_INTV){
            date_ct_led8s=0;
            if(date_move_direction_led8s){
                if(date_pos_led8s++>8){
                    date_pos_led8s=9;
                    if(date_ct_led8s_lastdelay--==0){
                        date_ct_led8s_lastdelay=LED8S_LASTDELAY;
                        date_move_direction_led8s=!date_move_direction_led8s;
                        GPIO_ResetBits(LED1_GPIO_GROUP,LED1_GPIO_PIN);
                    }
                }
                if(date[date_pos_led8s]=='.' ||
                        date[date_pos_led8s]==':')
                    date_pos_led8s++;
            }
            else{
                if(date_pos_led8s--<=0){
                    date_pos_led8s=0;
                    if(date_ct_led8s_lastdelay--==0){
                        date_ct_led8s_lastdelay=LED8S_LASTDELAY;
                        date_move_direction_led8s=!date_move_direction_led8s;
                        GPIO_SetBits(LED1_GPIO_GROUP,LED1_GPIO_PIN);
                        if(min_zero()){
                            auto_time_correct_10s();
                        }
                    }
                }
                if(date[date_pos_led8s]=='.' ||
                        date[date_pos_led8s]==':')
                    if(date_pos_led8s!=0)
                        date_pos_led8s--;
            }
            //prt_hex(date_move_direction_led8s);
            //prt_hex(date_ct_led8s_lastdelay);
            lcd_lprintf(1, 0x10000,0,date+date_pos_led8s);
        }
    }
}
/*led8s display end*/


#if 0
struct emulate_touch g_fake_touch = {0};
struct emulate_touch *gftp=&g_fake_touch;
void os_touch(void*p)
{
    struct point pt;
    struct point pt_cache;
    int touch_pressed = 0;
    (void)p;
    while(1){
        if(gftp->n_pt && gftp->pts){
            u32 test_time;
            gftp->cur_interval++;
            if(gftp->cur_interval >= gftp->interval){
                gftp->cur_interval = 0;
                if(gftp->cur_n_pt >= gftp->n_pt){
                    gftp->cur_n_pt = 0;
                }
                pt_cache = gftp->pts[gftp->cur_n_pt++];
                touch_pressed = 1;
                test_time = g_ms_count-gftp->start;
                if(gftp->last*60*1000u < test_time){//test done
                    gftp->pts =NULL;
                    lprintf("##########stress test end %s\n", get_rtc_time(0));
                    lprintf("##########stress test time long %d mins %d s %d ms\n",
                            test_time/1000/60,
                            (test_time/1000)%60, test_time%1000);
                }
            }
        }
        if(touch_down()){
            touch_pressed = 1;
            if(get_TP_point(&pt.px, &pt.py)){
                //lprintf("touch: %d %d\n", pt.px, pt.py);
                pt_cache = pt;
            }
        }
        else{
            if(touch_pressed == 1){
                os_lock(&oslk_evt);
                evt *dtw=RB_W_GET_wait(evt, rb_evt);
                //do work
                dtw->type = EVT_SCRN_TOUCH_UP;
                memcpy(dtw->pkg, &pt_cache, sizeof(struct point));
                RB_W_SET(evt, rb_evt);
                os_unlock(&oslk_evt);
            }
            touch_pressed = 0;
        }
        os_ms_delay(20);
    }
}
#endif
static inline u32 get_sp()
{
    register u32 __reg_sp __asm("sp");
    return (__reg_sp);
}

int get_sound_sta()
{
    return sound_enable;
}
void enable_sound(int en)
{
    sound_enable = en;
}
void timer_init(uint16_t arr, uint16_t psr)
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    lprintf("arr %x psr %x\n", arr, psr);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    TIM_DeInit(TIM2);
    TIM_InternalClockConfig(TIM2);
    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period = arr;
    TIM_TimeBaseStructure.TIM_Prescaler = psr;
    TIM_TimeBaseStructure.TIM_ClockDivision = 0;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

#if 0
    /* Output Compare Toggle Mode configuration: Channel1 */
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Toggle;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = arr/2;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
    TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Disable;
    TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;
    TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Set;
    TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
    TIM_OC1Init(TIM2, &TIM_OCInitStructure);

    TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Disable);

