cleanli2/stm32/src/common.c
        TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

        TIM_ARRPreloadConfig(TIM3, DISABLE);

        TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
        NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
        NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
        NVIC_Init(&NVIC_InitStructure);

        /* TIM enable counter */
        TIM_Cmd(TIM3, ENABLE);
        beep_st = hz_100;
    }
    else{
        if(beep_st == 0)return;
        beep_st = 0;
        TIM_Cmd(TIM3, DISABLE);
        NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
        NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
        NVIC_Init(&NVIC_InitStructure);
        TIM_ITConfig(TIM3, TIM_IT_Update, DISABLE);
        TIM_DeInit(TIM3);
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, DISABLE);
        /*
        GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
        GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
        GPIO_SetBits(BEEP_GPIO_GROUP,BEEP_GPIO_PIN);
        */
    }
}

void beep_by_timer(uint32_t hz)
{
    beep_by_timer_100(hz*100);
}

u32*TIM3_IRQHandler_local(u32*stack_data)
{
    static int tog=0;
    tm_cpt_start();
#if 0
    lprintf_time_buf(1, "tm3-\n");
#endif
    //if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
    TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
    if(sound_enable){
        if(tog++&0x1){
            //GPIO_SetBits(BEEP_GPIO_GROUP,BEEP_GPIO_PIN);
        }
        else{
            //GPIO_ResetBits(BEEP_GPIO_GROUP,BEEP_GPIO_PIN);
        }
    }
#if 0
    lprintf_time_buf(1, "tm3-\n");
#endif
    intrpt_time[INTTIM3]=tm_cpt_end();
    return stack_data;
}

void power_off()
{
    Show_Str(20, 630,RED,0xffff,"Power off in 3 seconds",24,0,1);
    lprintf_time("power off in 3 secs\n");
    foce_save_log_func();
    //beep(600, 100);
#ifdef RTC_8563
    check_rtc_alert_and_clear();
    auto_time_alert_set(AUTO_TIME_ALERT_INC_MINS, -1, -1);
    auto_time_correct();
#endif
#ifndef ALIENTEK_MINI
    lprintf_time("gpio setb\n");
    foce_save_log_func();
    GPIO_SetBits(GPIOB,GPIO_Pin_0);
    lprintf_time("gpio setb done\n");
#endif
    //power off pin set high to power down
    RCC_APB2PeriphClockCmd(POWEROFF_GPIO_PERIPH, ENABLE);

    GPIO_InitStructure.GPIO_Pin = POWEROFF_GPIO_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(POWEROFF_GPIO_GROUP, &GPIO_InitStructure);
    GPIO_SetBits(POWEROFF_GPIO_GROUP, POWEROFF_GPIO_PIN);
    //

    delay_ms(200);
    lprintf_time("power off done\n");
    while(1);
}
typedef struct timer_struct
{
    date_info_t start;
    uint32_t seconds_len;
    uint32_t repeat:15;
    uint32_t to_repeat:15;
    uint8_t running:1;
    uint8_t timeout_poff:1;
} timer_struct_t;
timer_struct_t g_timer = {0};

typedef struct progress_indicator
{
    uint32_t x;
    uint32_t y;
    uint32_t w;
    uint32_t h;
    uint16_t f_color;
    uint16_t b_color;
} progress_indicator_t;
progress_indicator_t g_timer_repeat_pi={
    120,
    50,
    260,
    20,
    YELLOW,
    BLACK
};
progress_indicator_t g_timer_pi={
    120,
    10,
    260,
    20,
    YELLOW,
    BLACK
};
void clear_progress_indicator(progress_indicator_t*pip)
{
    lcd_clr_window(WHITE, pip->x, pip->y, pip->x+pip->w, pip->y+pip->h);
}

void w10ms_delay(u32 ct)
{
    u32 x;
    x = g_10ms_count + ct;
    while(x > g_10ms_count)
    {
        //putchars("\nx=");
        //print_hex(x);
    }
}

void update_progress_indicator(progress_indicator_t*pip, uint32_t progressed, uint32_t total)
{
    uint32_t t;
    lcd_clr_window(pip->b_color, pip->x, pip->y, pip->x+pip->w, pip->y+pip->h);
    t = pip->w*progressed/total;
    if(t>0)lcd_clr_window(pip->f_color, pip->x, pip->y, pip->x+t, pip->y+pip->h);
    lcd_lprintf(1, pip->x+pip->w+5, pip->y, "%d/%d", progressed, total);
}
#define AUTO_POWER_OFF_COUNT 100000
//static uint32_t single_timer_len = 16;
/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
u32 task1_stack[STACK_SIZE_LOCAL];
u32 task2_stack[STACK_SIZE_LARGE*2];
u32 task_log_stack[STACK_SIZE_LOCAL];
u32 touch_stack[STACK_SIZE_LARGE];
u32 display_stack[STACK_SIZE_LARGE*2];
u32 cmd_stack[STACK_SIZE_LARGE];
u32 led8s_stack[STACK_SIZE_LARGE*2];
u32 music_stack[STACK_SIZE_LARGE];
void main_init(void)
{
  /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f10x_xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f10x.c file
     */     
  int looptimes = 3;
  //uint32_t ict;
  RCC_ClocksTypeDef RCC_ClocksStatus;

  //power off pin set low
  RCC_APB2PeriphClockCmd(POWEROFF_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = POWEROFF_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(POWEROFF_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(POWEROFF_GPIO_GROUP, POWEROFF_GPIO_PIN);
  //power off pin end

  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

  STM_COMInit(COM1, &USART_InitStructure);
  /* To achieve GPIO toggling maximum frequency, the following  sequence is mandatory. 
     You can monitor PD0 or PD2 on the scope to measure the output signal. 
     If you need to fine tune this frequency, you can add more GPIO set/reset 
     cycles to minimize more the infinite loop timing.
     This code needs to be compiled with high speed optimization option.  */

  //lprintf("debug_enable %X@%X vs %X\n", debug_enable, &debug_enable, 0xdeb49eab);
  if(0xdeb49eab==debug_enable){
      debug_mode = 1;
      debug_enable=0;
      os_is_running=0;
      lprintf("Go to debug mode\n");
      run_cmd_interface();
  }
  else{
      debug_mode = 0;
      lprintf("prepare debug\n");
      debug_enable = 0xdeb49eab;
  }
  systick_init();

  //PB3 PB4 PA15 PA13 PA14 set to gpio instead of SWJ
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
  //Touch_Test();

