cleanli2/stm32/src/common.c
  os_task_init();

  //72M/72=1M, 1us/count
  //72M/12=6M, 1/6us / count
  timer_init(TIM2_RELOAD, 12-1);

  GPIO_InitTypeDef GPIO_InitStructure;
  //led
#ifndef RTC_SOC
  RTC_Init();
#endif
#ifdef ALIENTEK_MINI
  lprintf_time("\n\n================ALIENTEK_MINI board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_8);
  GPIO_ResetBits(GPIOA,GPIO_Pin_13);

/*
  RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
*/

  RCC_APB2PeriphClockCmd(LED0_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = LED0_GPIO_PIN;
  GPIO_Init(LED0_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(LED0_GPIO_GROUP, LED0_GPIO_PIN);

  RCC_APB2PeriphClockCmd(LED1_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = LED1_GPIO_PIN;
  GPIO_Init(LED1_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(LED1_GPIO_GROUP, LED1_GPIO_PIN);
#elif defined SUNRISE
  lprintf_time("\n\n================SUNRISE board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  /* Configure in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_0;//PB4 spi flash cs
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOC,GPIO_Pin_0);	
  GPIO_SetBits(GPIOC,GPIO_Pin_4);//spi flash cs =1

#else
  lprintf_time("\n\n================Hamer board start================\n");
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOA,GPIO_Pin_15|GPIO_Pin_14|GPIO_Pin_13);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  /* Configure PD0 and PD2 in output pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_0;//PB4 spi flash cs
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOB,GPIO_Pin_0);	
  GPIO_SetBits(GPIOB,GPIO_Pin_4);//spi flash cs =1

#endif
  //led end
  led8s_init();

  RCC_GetClocksFreq(&RCC_ClocksStatus);
  lprintf_time("Version %s%s\n", VERSION, GIT_SHA1);
  get_rtc_time(0);
  lprintf_time("%s\n", get_rtc_time(0));
  lprintf("clk %d %d %d %d %d Hz\n\r",
		  RCC_ClocksStatus.SYSCLK_Frequency,
		  RCC_ClocksStatus.HCLK_Frequency,
		  RCC_ClocksStatus.PCLK1_Frequency,
		  RCC_ClocksStatus.PCLK2_Frequency,
		  RCC_ClocksStatus.ADCCLK_Frequency);
  lprintf_time("lcd init\n");
  lcd_sueb_init(0);
  lprintf_time("lcd init done.\n");
  lprintf_time("SD init\n");
  SD_Init();
  lprintf_time("SD init done\n");
  //SD_LowLevel_Init();

  /*1us/timer_count, 10ms/timer_intrpt*/
  while (looptimes--)
  {
      led_flash(0x3, 100);
  }
  //beep_by_timer_100(0);
  os_task_add(os_task_log, task_log_stack, "log", STACK_SIZE_LOCAL, 5);
  os_task_add(os_task1, task1_stack, "t1", STACK_SIZE_LOCAL, 1);
  //os_task_add(os_task2, task2_stack, "t2", STACK_SIZE_LARGE*2, 2);
  os_task_add(os_task3, cmd_stack, "cmd", STACK_SIZE_LARGE, 4);
  //os_task_add(os_touch, touch_stack, "touch", STACK_SIZE_LARGE, 2);
  os_task_add(os_task_display, display_stack, "display", STACK_SIZE_LARGE*2, 7);
  os_task_add(task_music, music_stack, "music", STACK_SIZE_LARGE, 6);
  os_task_add(led8s_task, led8s_stack, "led8s", STACK_SIZE_LOCAL*2, 0);
  while(1){
  }
}

#if 0
DECLARE_OS_LOCK(oslktest, 3);
void os_lock_test()
{
    lprintf("task %s wait lock\n", cur_os_task->name);
    os_lock(&oslktest);
    lprintf("task %s in\n", cur_os_task->name);
    os_ms_delay(200);
    lprintf("task %s out\n", cur_os_task->name);
    os_unlock(&oslktest);
    lprintf("task %s release lock\n", cur_os_task->name);
}
#endif

void os_task1(void*p)
{
    int td = 0;
    u32 direct = 1;
    (void)p;
    while(1){
        //mem_print(cur_os_task, cur_os_task, sizeof(os_task_st));
        os_ms_delay(td/2);
        //putchars("1 1\n");
        GPIO_SetBits(LED0_GPIO_GROUP,LED0_GPIO_PIN);
        os_ms_delay(20-td/2+1);
        //putchars("1 0\n");
        GPIO_ResetBits(LED0_GPIO_GROUP,LED0_GPIO_PIN);
#if 1
        if(direct){
            td++;
            if(td>=40){
                direct = 0;
            }
        }
        if(!direct){
            td--;
            if(td<=0){
                direct = 1;
            }
        }
#endif
    }
}
void os_task3(void*p)
{
    (void)p;
    while(1){
        run_cmd_interface();
    }
}
void os_task2(void*p)
{
    (void)p;
    while(1){
        os_ms_delay(1000);
    }
}
void soft_reset_system()
{
    lprintf_time("system reset\n");
    foce_save_log_func();
    set_BL_value(0);
    //LCD_RESET();
    __disable_fault_irq();
    NVIC_SystemReset();
}

void reboot_download()
{
    lprintf_time("reboot download\n");
    GPIO_SetBits(GPIOA,GPIO_Pin_13);
    delay_ms(100);
    //beep(100, 500);
    lprintf_time("reboot download\n");
    foce_save_log_func();
    soft_reset_system();
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  lprintf("Wrong parameters value: file %s on line %d\r\n", file, line);
  /* Infinite loop */
  while (1)
  {
  }
}

#endif

/************************util***********************/
uint add_with_limit(uint a, uint b, uint limit)
{
    uint ret = a + b;
    if(ret >= limit){
        ret -= limit;
    }
    return ret;
}
uint sub_with_limit(uint a, uint b, uint limit)
{
    uint ret;
    if(a>=b){
        ret = a-b;
    }
    else{
        ret = a+limit-b;
    }
    return ret;
}
